NextFOAM-2602/tutorials/heatTransfer/overBuoyantPimpleDyMFoam/movingBox/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

# Serial
runApplication $(getApplication)

# Parallel
#runApplication decomposePar -cellDist
#runParallel  $(getApplication)

#post
runApplication foamToVTK

#------------------------------------------------------------------------------
